app/controllers/api/v1/users_controller.rb

SELECT COUNT(*) FROM "users"
---
	def count
		render(json: { :users => { :count => User.count }})

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "mvg"]]
---
	def show_by_username
		user = User.find_by_username(params[:name])